# Exploratory Data Analysis

In [6]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns
import math
from datetime import datetime, date, time

In [10]:
data_folder='data/'
df_t = pd.read_csv(data_folder + '2t.csv')
print(df_t.shape)
pd.set_option('display.max_columns', None)
df_t.head()

(68300, 3)

         date state_name  2m max temperature
0  2005-01-01   ILLINOIS           281.98935
1  2005-01-02   ILLINOIS           287.57990
2  2005-01-03   ILLINOIS           280.19630
3  2005-01-04   ILLINOIS           277.75946
4  2005-01-05   ILLINOIS           275.99216

In [8]:
data_folder='data/'
df_p = pd.read_csv(data_folder + 'tp.csv')
print(df_p.shape)
pd.set_option('display.max_columns', None)
df_p.head()

(68330, 3)

         date state_name  total precipitation
0  2005-01-01   ILLINOIS             2.398395
1  2005-01-02   ILLINOIS             7.677360
2  2005-01-03   ILLINOIS            24.067541
3  2005-01-04   ILLINOIS             5.230138
4  2005-01-05   ILLINOIS            27.008377

In [9]:
data_folder='data/'
df_yield = pd.read_csv(data_folder + 'yield.csv')
print(df_yield.shape)
pd.set_option('display.max_columns', None)
df_yield.head()

(554, 3)

  state_name  year  yield
0    ALABAMA  2005   33.0
1   ARKANSAS  2005   34.0
2   DELAWARE  2005   26.0
3    FLORIDA  2005   32.0
4    GEORGIA  2005   26.0